deeprfid/alarm_board/HC32F4A0_OTA/hc32f4a0_app/projects/usb_lib/examp/usb_dev_user.c
/*******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 */
/******************************************************************************/
/** \file usb_dev_user.c
 **
 ** A detailed description is available at
 ** @link
        This file includes the user application layer.
    @endlink
 **
 **   - 2021-04-14  CDT First version for USB demo.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ddl.h"
#include "usb_dev_user.h"
#include "usb_dev_ctrleptrans.h"
#include "usb_app_conf.h"
#include "usb_bsp.h"
#include "io_stream.h"

void usb_dev_user_init(void);
void usb_dev_user_rst (void);
void usb_dev_user_devcfg (void);
void usb_dev_user_devsusp(void);
void usb_dev_user_devresume(void);
void usb_dev_user_conn(void);
void usb_dev_user_disconn(void); 
volatile int gIsUsbAvailable = 0;
/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/
usb_dev_user_func user_cb =
{
    &usb_dev_user_init,
    &usb_dev_user_rst,
    &usb_dev_user_devcfg,
    &usb_dev_user_devsusp,
    &usb_dev_user_devresume,
    &usb_dev_user_conn,
    &usb_dev_user_disconn,
};

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 *******************************************************************************
 ** \brief  usb_dev_user_init
 ** \param  none
 ** \retval none
 ******************************************************************************/
void usb_dev_user_init(void)
{
    /* Setup SysTick Timer for 20 msec interrupts This interrupt is used to probe the joystick */
	/*
    if (SysTick_Config(SystemCoreClock / 50u))
    {

        while (1)
        {
            ;
        }
    }
	*/
}

/**
 *******************************************************************************
 ** \brief  usb_dev_user_rst
 ** \param  none
 ** \retval none
 ******************************************************************************/
void usb_dev_user_rst(void)
{
//    printf(">>USB Device Library.\n" );
}

/**
 *******************************************************************************
 ** \brief  usb_dev_user_devcfg
 ** \param  none
 ** \retval none
 ******************************************************************************/
void usb_dev_user_devcfg (void)
{
	gIsUsbAvailable = 1;
	gUsbParams[0].usb_head = 0;
	gUsbParams[0].usb_tail = 0;
	gUsbParams[1].usb_head = 0;
	gUsbParams[1].usb_tail = 0;
 //   printf(">>The Interface for composite device of HID and CDC starts.\n");
}

/**
 *******************************************************************************
 ** \brief  usb_dev_user_conn
 ** \param  none
 ** \retval none
 ******************************************************************************/
void usb_dev_user_conn (void)
{
//    DDL_Printf(">>The USB composite device connects.\n");
}

/**
 *******************************************************************************
 ** \brief  USBD_USR_DeviceDisonnected
 ** \param  none
 ** \retval none
 ******************************************************************************/
void usb_dev_user_disconn (void)
{
//    printf(">>The USB composite device disconnected.\n");
}

/**
 *******************************************************************************
 ** \brief  usb_dev_user_devsusp
 ** \param  none
 ** \retval none
 ******************************************************************************/
void usb_dev_user_devsusp(void)
{
	gIsUsbAvailable = 0;
//    printf(">>The USB composite device is in suspending Status.\n");
}

/**
 *******************************************************************************
 ** \brief  usb_dev_user_devresume
 ** \param  none
 ** \retval none
 ******************************************************************************/
void usb_dev_user_devresume(void)
{
//    printf(">>The USB composite device resumes.\n");
}

/*******************************************************************************
 * EOF 
 ******************************************************************************/
